wsdl-demo/wsdl-client-demo/src/main/wsdl/hello.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-b02-. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-b02-. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:tns="http://server.wsdl.demo.huaminglin/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  name="HelloProviderService" targetNamespace="http://server.wsdl.demo.huaminglin/"
  xmlns="http://schemas.xmlsoap.org/wsdl/">
  <binding name="HelloProviderPortBinding" type="tns:HelloProvider">
    <operation name="sayHello">
      <input>
        <soap:body namespace="http://server.wsdl.demo.huaminglin/" use="literal"/>
      </input>
      <output>
        <soap:body namespace="http://server.wsdl.demo.huaminglin/" use="literal"/>
      </output>
      <soap:operation soapAction=""/>
    </operation>
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
  </binding>
  <message name="sayHelloResponse">
    <part name="return" type="tns:helloResponse"/>
  </message>
  <message name="sayHello">
    <part name="guestname" type="tns:helloRequest"/>
  </message>
  <portType name="HelloProvider">
    <operation name="sayHello">
      <input message="tns:sayHello"/>
      <output message="tns:sayHelloResponse"/>
    </operation>
  </portType>
  <service name="HelloProviderService">
    <port binding="tns:HelloProviderPortBinding" name="HelloProviderPort">
      <soap:address location="http://wsdl-sample/hello/helloProvider"/>
    </port>
  </service>
  <types>
    <xsd:schema>
      <xsd:import namespace="http://server.wsdl.demo.huaminglin/" schemaLocation="hello.xsd"/>
    </xsd:schema>
  </types>
</definitions>
